src/cf/Catalogs/вогПоказателиЗаполнености.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогПоказателиЗаполнености</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСхемыКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОбъектыЗначенийКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыЗначенийКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_Классификаторы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_АналитикаКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ВидыОтображенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыОтображенияКлассификаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вхождение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдиночноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельнымСписком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщимСписком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/вогРаспределительныеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогРаспределительныеЦентры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДляЛогистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРегионыДляЦелейЛогистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентрыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогГорода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРайоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRM_ОсновнойДляСвязи</Name>
							<Comment>Основной вид контактной информации для связи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогПоказателиЗаполнености/Ext/ObjectModule.bsl
Процедура ПолучитьСхемуКомпоновкиРасчетаЗначенийПоказателя(АдресСхемыКомпоновкиДанных,АдресНастроекКомпоновкиДанных, ИнициализироватьСхемуКомпоновки) Экспорт
		
	Если ИнициализироватьСхемуКомпоновки Тогда
		
		СКД 			= ИнициализироватьСхемуКомпоновкиРасчетаЗначенийПоказателя();
		НастройкиСКД 	= СКД.НастройкиПоУмолчанию;
		
	Иначе		
		
		СКД 			= ХранилищеСхемыКомпоновкиДанных.Получить();	
		НастройкиСКД 	= ХранилищеНастроекКомпоновкиДанных.Получить();	
		
	КонецЕсли;
			
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	
	АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(НастройкиСКД, Новый УникальныйИдентификатор);
	
КонецПроцедуры

Функция ИнициализироватьСхемуКомпоновкиРасчетаЗначенийПоказателя() 
	
	СКД = ПолучитьМакет("СхемаКомпоновкиРасчетаЗначенийПоказателя");
	               	
	//Если Ссылка.Пустая() Тогда
	//	ПоказательСсылка = Справочники.вогПоказателиЗаполнености.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//	УстановитьСсылкуНового(ПоказательСсылка);	
	//Иначе
	//	ПоказательСсылка = Ссылка;		
	//КонецЕсли;
	//
	//СКД.Параметры.Показатель.Значение = ПоказательСсылка;
		
	Если Не ПустаяСтрока(ИмяОбъектаМетаданных) Тогда
		
		СКД.НаборыДанных.ДанныеОбъекта.Запрос = ПолучитьТекстЗапросаКДаннымОбъектаРасчета();
		
	КонецЕсли;
	
	Возврат СКД;
	
КонецФункции

Функция ПолучитьТекстЗапросаКДаннымОбъектаРасчета()
//START Кайдашов 03/07/19 добавил характеристики в запрос по умолчанию
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДанныеОбъектаРасчета.Ссылка КАК Объект
	               |ИЗ
	               |	Справочник.%1 КАК ДанныеОбъектаРасчета
	               |{ХАРАКТЕРИСТИКИ
	               |	ТИП(Справочник.вогРаспределительныеЦентры, Справочник.вогТорговыеТочки, Справочник.вогЮридическиеЛица, Справочник.Партнеры, Справочник.КонтактныеЛицаПартнеров)
	               |	ВИДЫХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
	               |			CRM_ДополнительныеРеквизитыКлассификаторов.ТипЗначения КАК ТипЗначения,
	               |			CRM_ЗначенияКлассификаторов.Наименование КАК Наименование,
	               |			CRM_ЗначенияКлассификаторов.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.CRM_ДополнительныеРеквизитыКлассификаторов КАК CRM_ДополнительныеРеквизитыКлассификаторов
	               |				ПО CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит = CRM_ДополнительныеРеквизитыКлассификаторов.Ссылка)
	               |	ПОЛЕКЛЮЧА Ссылка
	               |	ПОЛЕИМЕНИ Наименование
	               |	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
	               |	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ОбъектыЗначенийКлассификаторов.Объект КАК Объект,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора КАК ЗначениеКлассификатора,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора.Владелец КАК ЗначениеКлассификатораВладелец,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеРеквизита КАК ЗначениеРеквизита
	               |		ИЗ
	               |			РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК CRM_ОбъектыЗначенийКлассификаторов)
	               |	ПОЛЕОБЪЕКТА Объект
	               |	ПОЛЕВИДА ЗначениеКлассификатора
	               |	ПОЛЕЗНАЧЕНИЯ ЗначениеРеквизита }
	               |{ХАРАКТЕРИСТИКИ
	               |	ТИП(Справочник.вогРаспределительныеЦентры, Справочник.вогТорговыеТочки, Справочник.вогЮридическиеЛица, Справочник.Партнеры, Справочник.КонтактныеЛицаПартнеров)
	               |	ВИДЫХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_Классификаторы.Ссылка КАК Ссылка,
	               |			CRM_Классификаторы.Наименование КАК Наименование,
	               |			CRM_Классификаторы.ТипЗначения КАК ТипЗначения
	               |		ИЗ
	               |			ПланВидовХарактеристик.CRM_Классификаторы КАК CRM_Классификаторы
	               |		ГДЕ
	               |			CRM_Классификаторы.ВидОтображения = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.CRM_ВидыОтображенияКлассификаторов.ОдиночноеЗначение))
	               |	ПОЛЕКЛЮЧА Ссылка
	               |	ПОЛЕИМЕНИ Наименование
	               |	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ОбъектыЗначенийКлассификаторов.Объект КАК Объект,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора КАК ЗначениеКлассификатора,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора.Владелец КАК ЗначениеКлассификатораВладелец,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеРеквизита КАК ЗначениеРеквизита
	               |		ИЗ
	               |			РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК CRM_ОбъектыЗначенийКлассификаторов)
	               |	ПОЛЕОБЪЕКТА Объект
	               |	ПОЛЕВИДА ЗначениеКлассификатораВладелец
	               |	ПОЛЕЗНАЧЕНИЯ ЗначениеКлассификатора }
	               |{ХАРАКТЕРИСТИКИ
	               |	ТИП(Справочник.вогРаспределительныеЦентры, Справочник.вогТорговыеТочки, Справочник.вогЮридическиеЛица, Справочник.Партнеры, Справочник.КонтактныеЛицаПартнеров)
	               |	ВИДЫХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ЗначенияКлассификаторов.Ссылка КАК Ссылка,
	               |			CRM_Классификаторы.Наименование + "" ("" + CRM_ЗначенияКлассификаторов.Наименование + "")"" КАК Наименование,
	               |			CRM_Классификаторы.ТипЗначения КАК ТипЗначения
	               |		ИЗ
	               |			Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.CRM_Классификаторы КАК CRM_Классификаторы
	               |				ПО CRM_ЗначенияКлассификаторов.Владелец = CRM_Классификаторы.Ссылка
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.CRM_ДополнительныеРеквизитыКлассификаторов КАК CRM_ДополнительныеРеквизитыКлассификаторов
	               |				ПО CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит = CRM_ДополнительныеРеквизитыКлассификаторов.Ссылка
	               |		ГДЕ
	               |			CRM_Классификаторы.ВидОтображения = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.CRM_ВидыОтображенияКлассификаторов.Вхождение))
	               |	ПОЛЕКЛЮЧА Ссылка
	               |	ПОЛЕИМЕНИ Наименование
	               |	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
	               |	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ОбъектыЗначенийКлассификаторов.Объект КАК Объект,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора КАК ЗначениеКлассификатора,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора.Владелец КАК ЗначениеКлассификатораВладелец,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеРеквизита КАК ЗначениеРеквизита
	               |		ИЗ
	               |			РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК CRM_ОбъектыЗначенийКлассификаторов)
	               |	ПОЛЕОБЪЕКТА Объект
	               |	ПОЛЕВИДА ЗначениеКлассификатора
	               |	ПОЛЕЗНАЧЕНИЯ ЗначениеРеквизита }
	               |{ХАРАКТЕРИСТИКИ
	               |	ТИП(Справочник.вогРаспределительныеЦентры, Справочник.вогТорговыеТочки, Справочник.вогЮридическиеЛица, Справочник.Партнеры, Справочник.КонтактныеЛицаПартнеров)
	               |	ВИДЫХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ЗначенияКлассификаторов.Ссылка КАК Ссылка,
	               |			CRM_Классификаторы.Наименование + "" ["" + CRM_ЗначенияКлассификаторов.Наименование + ""]"" КАК Наименование,
	               |			CRM_Классификаторы.ТипЗначения КАК ТипЗначения
	               |		ИЗ
	               |			Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.CRM_Классификаторы КАК CRM_Классификаторы
	               |				ПО CRM_ЗначенияКлассификаторов.Владелец = CRM_Классификаторы.Ссылка
	               |				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.CRM_ДополнительныеРеквизитыКлассификаторов КАК CRM_ДополнительныеРеквизитыКлассификаторов
	               |				ПО CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит = CRM_ДополнительныеРеквизитыКлассификаторов.Ссылка
	               |		ГДЕ
	               |			CRM_Классификаторы.ВидОтображения = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.CRM_ВидыОтображенияКлассификаторов.Вхождение)
	               |			И CRM_ДополнительныеРеквизитыКлассификаторов.Ссылка ЕСТЬ NULL)
	               |	ПОЛЕКЛЮЧА Ссылка
	               |	ПОЛЕИМЕНИ Наименование
	               |	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	               |			CRM_ОбъектыЗначенийКлассификаторов.Объект КАК Объект,
	               |			ИСТИНА КАК Значение,
	               |			CRM_ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора КАК ЗначениеКлассификатора
	               |		ИЗ
	               |			РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК CRM_ОбъектыЗначенийКлассификаторов)
	               |	ПОЛЕОБЪЕКТА Объект
	               |	ПОЛЕВИДА ЗначениеКлассификатора }";	

	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ИмяОбъектаМетаданных);

	Возврат ТекстЗапроса;

КонецФункции

Процедура ПроверкаКорректностиНастроекСКД(СКД, НастройкиСКД, Отказ) Экспорт
			
	ПользовательскоеПолеЗначение = Новый ПолеКомпоновкиДанных("ПользовательскиеПоля.Поле1");
	
	МассивВыбранныхПолей = Новый Массив;
	
	ВыбранныеПоля = НастройкиСКД.Выбор.Элементы;
	
	Для Каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		МассивВыбранныхПолей.Добавить(ВыбранноеПоле.Поле);	
	КонецЦикла;
	
	МассивПолей = ПолучитьМассивОбязательныхПолейРезультирующейВыборки();
	
	Для Каждого ПроверяемоеПоле Из МассивПолей Цикл
		
		Если МассивВыбранныхПолей.Найти(ПроверяемоеПоле)=Неопределено Тогда
			
			Если ПроверяемоеПоле = ПользовательскоеПолеЗначение Тогда
				Сообщить("В настройках схемы компоновки данных не задано обязательное пользовательское поле выбора: ""Значение""");
			Иначе
				Сообщить("В настройках схемы компоновки данных не задано обязательное поле выбора: """+Строка(ПроверяемоеПоле)+"""");
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры

Функция ПолучитьМассивОбязательныхПолейРезультирующейВыборки()
	
	МассивОбязательныхПолей = Новый Массив;
	
	Измерения = Метаданные.РегистрыСведений.вогЗначенияРасчетаПоказателейЗаполненности.Измерения;
	
	Для Каждого Поле Из Измерения Цикл
		//Кайдашов 13/06/19 добавил проверку только для  запрета незаполненных значений
		Если Поле.ЗапрещатьНезаполненныеЗначения тогда
			МассивОбязательныхПолей.Добавить(Новый ПолеКомпоновкиДанных(Поле.Имя));	
		КонецЕсли;	
	КонецЦикла;
	
	// в регистре присутствует один единственный ресурс - значение, для которого в компоновке обязательно должно 
	// присутствовать пользовательское поле ПользовательскиеПоля.Поле1
	МассивОбязательныхПолей.Добавить(Новый ПолеКомпоновкиДанных("ПользовательскиеПоля.Поле1"));	
		
	Возврат МассивОбязательныхПолей;
	
КонецФункции
